## Import pandas, numpy, sqlite3

In [1]:
import pandas as pd 
import numpy as np
import sqlite3
conn = sqlite3.connect('CourseData.db')
c = conn.cursor()

## Run this to set up %sql and %%sql magics and connect to CourseData Database

In [2]:
%load_ext sql

In [3]:
%%sql
sqlite:///CourseData.db

'Connected: @CourseData.db'

## Drop Import Tables For Any Future Rerun of Code

In [4]:
%%sql
drop table if exists import_courses;

 * sqlite:///CourseData.db
Done.

[]

In [5]:
%%sql
drop table if exists import_cmeetings;

 * sqlite:///CourseData.db
Done.

[]

In [6]:
%%sql
drop table if exists import_catalog;

 * sqlite:///CourseData.db
Done.

[]

## Create Import Tables

In [7]:
%%sql
create table 'import_catalog' (
    program_code TEXT NOT NULL,
    program_name VARCHAR NOT NULL,
    catalog_id VARCHAR NOT NULL,
    course_title VARCHAR NOT NULL, 
    credits VARCHAR NOT NULL,
    prereqs VARCHAR, 
    coreqs VARCHAR,
    fees VARCHAR,
    attributes VARCHAR,
    description VARCHAR 
);

 * sqlite:///CourseData.db
Done.

[]

In [8]:
%%sql
create table 'import_cmeetings' (
    term VARCHAR NOT NULL,
    crn INTEGER NOT NULL,
    location VARCHAR NOT NULL,
    day TEXT NOT NULL,
    start VARCHAR NOT NULL,
    end VARCHAR NOT NULL 
);

 * sqlite:///CourseData.db
Done.

[]

In [9]:
%%sql
create table 'import_courses' (
    term VARCHAR NOT NULL,
    crn INTEGER NOT NULL,
    catalog_id VARCHAR NOT NULL,
    section VARCHAR NOT NULL,
    credits VARCHAR,
    title VARCHAR, 
    meetings VARCHAR,
    timecodes VARCHAR, 
    primary_instructor TEXT,
    cap INTEGER, 
    act INTEGER, 
    rem INTEGER 
);

 * sqlite:///CourseData.db
Done.

[]

## Import CSV Files

#### Import Courses CSVs using Python Pandas

Loading Files By Season

In [10]:
fall = ['SourceData/Fall2014/courses.csv',
        'SourceData/Fall2015/courses.csv', 
        'SourceData/Fall2016/courses.csv',
        'SourceData/Fall2017/courses.csv',
        'SourceData/Fall2018/courses.csv']
fall_0 = pd.read_csv(fall[0])
fall_1 = pd.read_csv(fall[1])
fall_2 = pd.read_csv(fall[2])    
fall_3 = pd.read_csv(fall[3])
fall_4 = pd.read_csv(fall[4])

In [11]:
winter = ['SourceData/Winter2015/courses.csv', 
          'SourceData/Winter2016/courses.csv',
          'SourceData/Winter2017/courses.csv',
          'SourceData/Winter2018/courses.csv']
winter_0 = pd.read_csv(winter[0])
winter_1 = pd.read_csv(winter[1])
winter_2 = pd.read_csv(winter[2])    
winter_3 = pd.read_csv(winter[3])

In [12]:
spring = ['SourceData/Spring2015/courses.csv',
          'SourceData/Spring2016/courses.csv', 
          'SourceData/Spring2017/courses.csv',
          'SourceData/Spring2018/courses.csv',
          'SourceData/Spring2019/courses.csv',
          'SourceData/SpringBreak2017/courses.csv']
spring_0 = pd.read_csv(spring[0])
spring_1 = pd.read_csv(spring[1])
spring_2 = pd.read_csv(spring[2])    
spring_3 = pd.read_csv(spring[3])
spring_4 = pd.read_csv(spring[4])
spring_5 = pd.read_csv(spring[5])

In [13]:
summer = ['SourceData/Summer2015/courses.csv', 
          'SourceData/Summer2016/courses.csv',
          'SourceData/Summer2017/courses.csv',
          'SourceData/Summer2018/courses.csv']
summer_0 = pd.read_csv(summer[0])
summer_1 = pd.read_csv(summer[1])
summer_2 = pd.read_csv(summer[2])    
summer_3 = pd.read_csv(summer[3])

Concatenating to Master Season Dataframes as well as a Master Course Dataframe

In [14]:
df_fall = pd.concat([fall_0,fall_1,fall_2,fall_3,fall_4], axis=0)

In [15]:
df_winter = pd.concat([winter_0,winter_1,winter_2,winter_3], axis=0)

In [16]:
df_spring = pd.concat([spring_0,spring_1,spring_2,spring_3,spring_4,spring_5], axis=0)

In [17]:
df_summer = pd.concat([summer_0,summer_1,summer_2,summer_3], axis=0)

In [18]:
df_course = pd.concat([df_fall, df_winter, df_spring, df_summer], axis=0)

Preview Dataframes

In [19]:
df_fall.head(1)

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
0,Fall2014,70384,AC 0011,C01,3.000,Introduction to Financial Accounting,"[{'days': 'TF', 'times': '0800am-0915am', 'dat...",['TF 0800am-0915am 09/02-12/08 DSB 105'],Michael P. Coyne,0,31,-31

In [20]:
df_winter.head(1)

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
0,Winter2015,10913,AC 0555,01,3.000,Issues in Internal Audit,"[{'days': 'MTWRF', 'times': '1000am-0600pm', '...","['MTWRF 1000am-0600pm 01/05-01/17 DSB 115', 'S...",Dawn W Massey,18,10,8

In [21]:
df_spring.head(1)

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
0,Spring2015,32436,AC 0011,A,3.000,Introduction to Financial Accounting,"[{'days': 'MR', 'times': '0200pm-0315pm', 'dat...",['MR 0200pm-0315pm 01/20-04/30 DSB 108'],Dawn W Massey,28,28,0

In [22]:
df_summer.head(1)

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
0,Summer2015,55230,AC 0203,A,3.000,Intermediate Accounting I,"[{'days': 'MW', 'times': '0600pm-0930pm', 'dat...","['MW 0600pm-0930pm 05/18-06/24 DSB 106', 'TR 0...",Scott M Brenner,25,9,16

In [23]:
df_course.head(1)

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
0,Fall2014,70384,AC 0011,C01,3.000,Introduction to Financial Accounting,"[{'days': 'TF', 'times': '0800am-0915am', 'dat...",['TF 0800am-0915am 09/02-12/08 DSB 105'],Michael P. Coyne,0,31,-31

Moving Dataframe from Python to SQL

In [24]:
df_course.to_sql('import_courses', conn, if_exists='append', index=False)

Preview the Import Courses Table

In [25]:
%%sql
select *
from import_courses
limit 1;

 * sqlite:///CourseData.db
Done.

[('Fall2014', 70384, 'AC 0011', 'C01', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31)]

#### Import Course Meetings CSVs using Python Pandas

Loading Files By Season

In [26]:
fall_2 = ['SourceData/Fall2014/course_meetings.csv',
         'SourceData/Fall2015/course_meetings.csv',
         'SourceData/Fall2016/course_meetings.csv',
         'SourceData/Fall2017/course_meetings.csv',
         'SourceData/Fall2018/course_meetings.csv']
fall_2_0  = pd.read_csv(fall_2[0])
fall_2_1  = pd.read_csv(fall_2[1])
fall_2_2  = pd.read_csv(fall_2[2])
fall_2_3  = pd.read_csv(fall_2[3])
fall_2_4  = pd.read_csv(fall_2[4])

In [27]:
winter_2 = ['SourceData/Winter2015/course_meetings.csv',
           'SourceData/Winter2016/course_meetings.csv',
           'SourceData/Winter2017/course_meetings.csv',
           'SourceData/Winter2018/course_meetings.csv']
winter_2_0  = pd.read_csv(winter_2[0])
winter_2_1  = pd.read_csv(winter_2[1])
winter_2_2  = pd.read_csv(winter_2[2])
winter_2_3  = pd.read_csv(winter_2[3])

In [28]:
spring_2 = ['SourceData/Spring2015/course_meetings.csv',
           'SourceData/Spring2016/course_meetings.csv',
           'SourceData/Spring2017/course_meetings.csv',
           'SourceData/Spring2018/course_meetings.csv',
           'SourceData/Spring2019/course_meetings.csv',
           'SourceData/SpringBreak2017/course_meetings.csv']
spring_2_0  = pd.read_csv(spring_2[0])
spring_2_1  = pd.read_csv(spring_2[1])
spring_2_2  = pd.read_csv(spring_2[2])
spring_2_3  = pd.read_csv(spring_2[3])
spring_2_4  = pd.read_csv(spring_2[4])
spring_2_5  = pd.read_csv(spring_2[5])

In [29]:
summer_2 = ['SourceData/Summer2015/course_meetings.csv',
           'SourceData/Summer2016/course_meetings.csv',
           'SourceData/Summer2017/course_meetings.csv',
           'SourceData/Summer2018/course_meetings.csv']
summer_2_0  = pd.read_csv(summer_2[0])
summer_2_1  = pd.read_csv(summer_2[1])
summer_2_2  = pd.read_csv(summer_2[2])
summer_2_3  = pd.read_csv(summer_2[3])

Concatenating to Master Season Dataframes as well as a Master Course Meetings Dataframe

In [30]:
df_fall_2 = pd.concat([fall_2_0,fall_2_1,fall_2_2,fall_2_3,fall_2_4], axis=0)

In [31]:
df_winter_2 = pd.concat([winter_2_0,winter_2_1,winter_2_2,winter_2_3], axis=0)

In [32]:
df_spring_2 = pd.concat([spring_2_0,spring_2_1,spring_2_2,spring_2_3,
spring_2_4,spring_2_5], axis=0)

In [33]:
df_summer_2 = pd.concat([summer_2_0,summer_2_1,summer_2_2,summer_2_3], axis=0)

In [34]:
df_cmeetings = pd.concat([df_fall_2,df_winter_2,df_spring_2,df_summer_2], axis=0)

Preview Dataframes

In [35]:
df_fall_2.head(1)

       term    crn location day                start                  end
0  Fall2014  70384  DSB 105   T  2014-09-02T08:00:00  2014-09-02T09:15:00

In [36]:
df_winter_2.head(1)

         term    crn location day                start                  end
0  Winter2015  10913  DSB 115   M  2015-01-05T10:00:00  2015-01-05T18:00:00

In [37]:
df_spring_2.head(1)

         term    crn location day                start                  end
0  Spring2015  32436  DSB 108   R  2015-01-22T14:00:00  2015-01-22T15:15:00

In [38]:
df_summer_2.head(1)

         term    crn location day                start                  end
0  Summer2015  55230  DSB 106   M  2015-05-18T18:00:00  2015-05-18T21:30:00

In [39]:
df_cmeetings.head(1)

       term    crn location day                start                  end
0  Fall2014  70384  DSB 105   T  2014-09-02T08:00:00  2014-09-02T09:15:00

Moving Dataframe from Python to SQL

In [40]:
df_cmeetings.to_sql('import_cmeetings', conn, if_exists='append', index=False)

Preview the Import Courses Table

In [41]:
%%sql
select *
from import_cmeetings
limit 1;

 * sqlite:///CourseData.db
Done.

[('Fall2014', 70384, 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00')]

#### Import CourseCatalog CSVs

In [42]:
catalog2017 = ['SourceData/Catalogs/CourseCatalog2017_2018.csv']
catalog2017_2018 = pd.read_csv(catalog2017[0])

In [43]:
catalog2018 = ['SourceData/Catalogs/CourseCatalog2018_2019.csv']
catalog2018_2019 = pd.read_csv(catalog2018[0])

Concatenating to Master Catalog Dataframe

In [44]:
df_catalog = pd.concat([catalog2017_2018,catalog2018_2019], axis=0)

Moving Dataframe from Python to SQL

In [45]:
df_catalog.to_sql('import_catalog', conn, if_exists='append', index=False)

Preview the Import Courses Table

In [46]:
%%sql
select *
from import_catalog
limit 1;

 * sqlite:///CourseData.db
Done.

[('AN', 'Asian Studies', 'AN 0301', 'Independent Study', '1-3 Credits', None, None, None, None, 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.')]

## Drop ERD Tables For Any Future Rerun of Code

In individual cells so we could drop individual tables as needed

In [47]:
%%sql
drop table if exists catalog_program;

 * sqlite:///CourseData.db
Done.

[]

In [48]:
%%sql
drop table if exists catalog_course;

 * sqlite:///CourseData.db
Done.

[]

In [49]:
%%sql
drop table if exists term;

 * sqlite:///CourseData.db
Done.

[]

In [50]:
%%sql
drop table if exists course_offering;

 * sqlite:///CourseData.db
Done.

[]

In [51]:
%%sql
drop table if exists instructor;

 * sqlite:///CourseData.db
Done.

[]

In [52]:
%%sql
drop table if exists course_meeting;

 * sqlite:///CourseData.db
Done.

[]

In [53]:
%%sql
drop table if exists time_code;

 * sqlite:///CourseData.db
Done.

[]

In [54]:
%%sql
drop table if exists location;

 * sqlite:///CourseData.db
Done.

[]

## Create Database Tables From ERD

In [55]:
%%sql
create table CATALOG_PROGRAM (
    CATALOG_ID VARCHAR PRIMARY KEY,
    PROGRAM_CODE TEXT NOT NULL,
    PROGRAM_NAME VARCHAR NOT NULL,
    COURSE_TITLE VARCHAR NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

In [56]:
%%sql
create table CATALOG_COURSE (
    CC_ID INTEGER PRIMARY KEY,
    COURSE_TITLE VARCHAR NOT NULL,
    PRE_REQS VARCHAR,
    CO_REQS VARCHAR,
    CATALOG_ID VARCHAR NOT NULL,
    FOREIGN KEY (CATALOG_ID) REFERENCES CATALOG_PROGRAM (CATALOG_ID)
);

 * sqlite:///CourseData.db
Done.

[]

In [57]:
%%sql
create table TERM (
    TERM_ID INTEGER PRIMARY KEY,
    TERM_NAME VARCHAR NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

In [58]:
%%sql
create table COURSE_OFFERING (
    CO_ID INTEGER PRIMARY KEY,
    CRN INTEGER NOT NULL,
    SECTION VARCHAR NOT NULL,
    COURSE_TITLE VARCHAR NOT NULL,
    CREDITS VARCHAR NOT NULL,
    TERM_NAME INTEGER NOT NULL,
    FOREIGN KEY (COURSE_TITLE) REFERENCES CATALOG_COURSE (COURSE_TITLE)
    FOREIGN KEY (TERM_NAME) REFERENCES TERM (TERM_NAME)
);

 * sqlite:///CourseData.db
Done.

[]

In [59]:
%%sql
create table INSTRUCTOR (
    I_ID INTEGER PRIMARY KEY,
    NAME TEXT NOT NULL,
    COURSE_TITLE VARCHAR NOT NULL,
    CRN INTEGER NOT NULL,
    TERM_NAME INTEGER NOT NULL,
    FOREIGN KEY (CRN) REFERENCES COURSE_OFFERING (CRN)
    FOREIGN KEY (TERM_NAME) REFERENCES TERM (TERM_NAME)
);

 * sqlite:///CourseData.db
Done.

[]

In [60]:
%%sql
create table COURSE_MEETING (
    CM_ID INTEGER PRIMARY KEY,
    CRN INTEGER NOT NULL,
    CAP INTEGER NOT NULL,
    ACT INTEGER,
    REM INTEGER,
    SECTION VARCHAR NOT NULL,
    TERM_NAME INTEGER NOT NULL,
    FOREIGN KEY (SECTION) REFERENCES COURSE_OFFERING (SECTION)
    FOREIGN KEY (TERM_NAME) REFERENCES TERM (TERM_NAME)
);

 * sqlite:///CourseData.db
Done.

[]

In [61]:
%%sql
create table TIME_CODE (
    TIME_ID INTEGER PRIMARY KEY,
    START_TIME VARCHAR NOT NULL,
    END_TIME VARCHAR NOT NULL,
    CRN INTEGER NOT NULL,
    TERM_NAME INTERGER NOT NULL,
    FOREIGN KEY (CRN) REFERENCES COURSE_OFFERING (CRN)
    FOREIGN KEY (TERM_NAME) REFERENCES TERM (TERM_NAME)
);

 * sqlite:///CourseData.db
Done.

[]

In [62]:
%%sql
create table LOCATION (
    ROOM_ID INTEGER PRIMARY KEY,
    Room_No VARCHAR NOT NULL,
    CRN INTEGER NOT NULL,
    TERM_NAME INTERGER NOT NULL,
    FOREIGN KEY (CRN) REFERENCES COURSE_MEETING (CRN)
    FOREIGN KEY (TERM_NAME) REFERENCES TERM (TERM_NAME)
);

 * sqlite:///CourseData.db
Done.

[]

#### Insert Data into ERD Tables

In [63]:
%%sql
INSERT INTO CATALOG_PROGRAM (CATALOG_ID, PROGRAM_CODE, PROGRAM_NAME, COURSE_TITLE)
    SELECT DISTINCT CATALOG_ID, PROGRAM_CODE, PROGRAM_NAME, COURSE_TITLE
    FROM IMPORT_CATALOG;

 * sqlite:///CourseData.db
2220 rows affected.

[]

In [64]:
%%sql
INSERT INTO CATALOG_COURSE (COURSE_TITLE, PRE_REQS, CO_REQS, CATALOG_ID)
    SELECT DISTINCT import_catalog.course_title, prereqs, coreqs, import_catalog.CATALOG_ID
    FROM IMPORT_CATALOG
    JOIN CATALOG_PROGRAM ON (IMPORT_CATALOG.catalog_id = CATALOG_PROGRAM.CATALOG_ID);

 * sqlite:///CourseData.db
2220 rows affected.

[]

In [65]:
%%sql
INSERT INTO TERM (TERM_NAME)
    SELECT DISTINCT TERM
    FROM IMPORT_CMEETINGS;

 * sqlite:///CourseData.db
19 rows affected.

[]

In [66]:
%%sql
INSERT INTO COURSE_OFFERING (CRN, SECTION, COURSE_TITLE, CREDITS, TERM_NAME)
    SELECT DISTINCT CRN, SECTION, COURSE_TITLE, CREDITS, TERM_NAME
    FROM IMPORT_COURSES
    JOIN CATALOG_COURSE ON (CATALOG_COURSE.COURSE_TITLE = IMPORT_COURSES.title)
    JOIN TERM on (IMPORT_COURSES.TERM = TERM.TERM_NAME);

 * sqlite:///CourseData.db
14330 rows affected.

[]

In [67]:
%%sql
INSERT INTO COURSE_MEETING (CRN, TERM_NAME, SECTION, CAP, ACT, REM)
    SELECT DISTINCT IMPORT_COURSES.CRN, TERM.TERM_NAME, IMPORT_COURSES.SECTION, CAP, ACT, REM
    FROM IMPORT_COURSES
    JOIN COURSE_OFFERING ON (COURSE_OFFERING.CRN = IMPORT_COURSES.CRN and course_offering.term_name = import_courses.term)
    JOIN TERM on (IMPORT_COURSES.TERM = TERM.TERM_NAME);

 * sqlite:///CourseData.db
14330 rows affected.

[]

In [68]:
%%sql
INSERT INTO INSTRUCTOR (NAME, COURSE_TITLE, CRN, TERM_NAME)
    SELECT DISTINCT primary_instructor, COURSE_TITLE, IMPORT_COURSES.CRN, TERM.TERM_NAME
    FROM IMPORT_COURSES
    JOIN COURSE_OFFERING ON (COURSE_OFFERING.COURSE_TITLE = IMPORT_COURSES.title)
    JOIN TERM on (IMPORT_COURSES.TERM = TERM.TERM_NAME);

 * sqlite:///CourseData.db
14330 rows affected.

[]

In [69]:
%%sql
INSERT INTO TIME_CODE (CRN, START_TIME, END_TIME, TERM_NAME)
    SELECT DISTINCT IMPORT_CMEETINGS.CRN, START, END, TERM.TERM_NAME
    FROM IMPORT_CMEETINGS
    JOIN COURSE_OFFERING ON (COURSE_OFFERING.CRN = IMPORT_CMEETINGS.crn)
    JOIN TERM on (IMPORT_CMEETINGS.TERM = TERM.TERM_NAME);

 * sqlite:///CourseData.db
296781 rows affected.

[]

In [70]:
%%sql
INSERT INTO LOCATION (ROOM_NO, CRN, TERM_NAME)
    SELECT DISTINCT LOCATION, IMPORT_CMEETINGS.CRN, TERM.TERM_NAME
    FROM IMPORT_CMEETINGS
    JOIN COURSE_MEETING ON (COURSE_MEETING.CRN = IMPORT_CMEETINGS.crn)
    JOIN TERM on (IMPORT_CMEETINGS.TERM = TERM.TERM_NAME);

 * sqlite:///CourseData.db
13032 rows affected.

[]

#### Data Checks

View 1 row from every ERD Table

In [72]:
%%sql
select * from CATALOG_PROGRAM limit 1;

 * sqlite:///CourseData.db
Done.

[('AN 0301', 'AN', 'Asian Studies', 'Independent Study')]

In [73]:
%%sql
select * from CATALOG_COURSE limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 'Independent Study', None, None, 'AN 0301')]

In [74]:
%%sql
select * from COURSE_OFFERING limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'C01', 'Introduction to Financial Accounting', '3.000', 'Fall2014')]

In [75]:
%%sql
select * from TERM limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 'Fall2014')]

In [76]:
%%sql
select * from COURSE_MEETING limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 0, 31, -31, 'C01', 'Fall2014')]

In [77]:
%%sql
select * from INSTRUCTOR limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne', 'Introduction to Financial Accounting', 70384, 'Fall2014')]

In [78]:
%%sql
select * from TIME_CODE limit 1;

 * sqlite:///CourseData.db
Done.

[(1, '2014-09-02T08:00:00', '2014-09-02T09:15:00', 70384, 'Fall2014')]

In [79]:
%%sql
select * from LOCATION limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 'DSB 105', 70384, 'Fall2014')]

#### Queries on Database

How many 5 credit classes are offered across the whole timeframe?

In [80]:
%%sql
select count(CO_ID)
from course_offering
where credits = '5.000';

 * sqlite:///CourseData.db
Done.

[(38,)]

Which terms has Python for Business Analytics been offered?

In [81]:
%%sql
select a.CATALOG_ID, b.CRN, b.COURSE_TITLE, b.CREDITS, c.TERM_NAME
from CATALOG_COURSE a, COURSE_OFFERING b, TERM c
where a.COURSE_TITLE=b.COURSE_TITLE
and b.term_name=c.term_name
and a.COURSE_TITLE = 'Python for Business Analytics';

 * sqlite:///CourseData.db
Done.

[('IS 0505', 72913, 'Python for Business Analytics', '3.000', 'Fall2017'),
 ('IS 0505', 75942, 'Python for Business Analytics', '3.000', 'Fall2018')]

Which instructors have taught/teach General Chemistry?

In [82]:
%%sql
select distinct b.name, a.course_title
from COURSE_OFFERING a, INSTRUCTOR b
where a.COURSE_TITLE=b.COURSE_TITLE
and a.COURSE_TITLE = 'General Chemistry I';

 * sqlite:///CourseData.db
Done.

[('Donald J.  Wolanin', 'General Chemistry I'),
 ('Gary H.  Weddle', 'General Chemistry I'),
 ('Jillian E.  Smith-Carpenter', 'General Chemistry I'),
 ('John R.  Miecznikowski', 'General Chemistry I'),
 ('Matthew A.  Kubasik', 'General Chemistry I'),
 ('Robert G.  Fischer', 'General Chemistry I'),
 ('Sangamithra   Chintapalli', 'General Chemistry I')]

Which rooms has Money and Banking been taught in?

In [83]:
%%sql
select distinct c.ROOM_NO, a.COURSE_TITLE 
from COURSE_OFFERING a, COURSE_MEETING b, LOCATION c
where a.CRN=b.CRN
and b.CRN=c.CRN
and a.COURSE_TITLE = 'Money and Banking';

 * sqlite:///CourseData.db
Done.

[('CNS 1', 'Money and Banking'),
 ('CNS 15', 'Money and Banking'),
 ('CNS 305', 'Money and Banking'),
 ('DMH 149', 'Money and Banking'),
 ('BNW 341', 'Money and Banking'),
 ('LYL 227B', 'Money and Banking'),
 ('NHS 403', 'Money and Banking'),
 ('LNG 109', 'Money and Banking'),
 ('DMH 350', 'Money and Banking'),
 ('DMH 347', 'Money and Banking')]

Which classes in Fall 2018 were over overcapacity? <br/> and limit 1 for preview

In [84]:
%%sql
select a.course_title, b.CAP, b.ACT
from COURSE_OFFERING a, COURSE_MEETING b, TERM c
where a.CRN=b.CRN
and b.TERM_NAME=c.TERM_NAME
and b.act > b.cap
and cap <> 0
and c.term_name = 'Fall2018'
limit 1;

 * sqlite:///CourseData.db
Done.

[('Introduction to Financial Accounting', 31, 33)]

#### Drop Import Tables to Save Space and also vacuum

In [85]:
%%sql
DROP TABLE IF EXISTS import_courses;
DROP TABLE IF EXISTS import_cmeetings;
DROP TABLE IF EXISTS import_catalog;
vacuum;

 * sqlite:///CourseData.db
Done.
Done.
Done.
Done.

[]